program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.9.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 46]> mask, tensor<fp32, [1, 1012, 34]> obs) {
            tensor<bool, []> var_10 = const()[name = tensor<string, []>("op_10"), val = tensor<bool, []>(false)];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> obs_to_fp16_dtype_0 = const()[name = tensor<string, []>("obs_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [192, 1012, 3]> brain_encoder_net_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_0_weight_to_fp16"), val = tensor<fp16, [192, 1012, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 1012, 34]> obs_to_fp16 = cast(dtype = obs_to_fp16_dtype_0, x = obs)[name = tensor<string, []>("cast_7")];
            tensor<fp16, [1, 192, 34]> input_1_cast_fp16 = conv(dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = brain_encoder_net_0_weight_to_fp16, x = obs_to_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<fp16, [192]> brain_encoder_net_1_res_unit_0_running_mean_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_res_unit_0_running_mean_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1165952)))];
            tensor<fp16, [192]> brain_encoder_net_1_res_unit_0_running_var_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_res_unit_0_running_var_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1166400)))];
            tensor<fp16, [192]> brain_encoder_net_1_res_unit_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_res_unit_0_weight_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1166848)))];
            tensor<fp16, [192]> brain_encoder_net_1_res_unit_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_res_unit_0_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1167296)))];
            tensor<fp16, []> var_6_to_fp16 = const()[name = tensor<string, []>("op_6_to_fp16"), val = tensor<fp16, []>(0x1.064p-10)];
            tensor<fp16, [1, 192, 34]> input_3_cast_fp16 = batch_norm(beta = brain_encoder_net_1_res_unit_0_bias_to_fp16, epsilon = var_6_to_fp16, gamma = brain_encoder_net_1_res_unit_0_weight_to_fp16, mean = brain_encoder_net_1_res_unit_0_running_mean_to_fp16, variance = brain_encoder_net_1_res_unit_0_running_var_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_0_cast_fp16 = softplus(x = input_3_cast_fp16)[name = tensor<string, []>("softplus_0_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_0_cast_fp16 = tanh(x = softplus_0_cast_fp16)[name = tensor<string, []>("tanh_0_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_5_cast_fp16 = mul(x = input_3_cast_fp16, y = tanh_0_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1167744)))];
            tensor<fp16, [192]> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1388992)))];
            tensor<fp16, [1, 192, 34]> input_9_cast_fp16 = conv(bias = const_1_to_fp16, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = const_0_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_1_cast_fp16 = softplus(x = input_9_cast_fp16)[name = tensor<string, []>("softplus_1_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_1_cast_fp16 = tanh(x = softplus_1_cast_fp16)[name = tensor<string, []>("tanh_1_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_11_cast_fp16 = mul(x = input_9_cast_fp16, y = tanh_1_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> x_1_pad_type_0 = const()[name = tensor<string, []>("x_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> x_1_pad_0 = const()[name = tensor<string, []>("x_1_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> x_1_strides_0 = const()[name = tensor<string, []>("x_1_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> x_1_dilations_0 = const()[name = tensor<string, []>("x_1_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> x_1_groups_0 = const()[name = tensor<string, []>("x_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> brain_encoder_net_1_res_unit_5_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_res_unit_5_weight_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1389440)))];
            tensor<fp16, [1, 192, 34]> x_1_cast_fp16 = conv(dilations = x_1_dilations_0, groups = x_1_groups_0, pad = x_1_pad_0, pad_type = x_1_pad_type_0, strides = x_1_strides_0, weight = brain_encoder_net_1_res_unit_5_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<bool, []> input_13_keep_dims_0 = const()[name = tensor<string, []>("input_13_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192]> input_13_cast_fp16 = reduce_mean(axes = input_13_axes_0, keep_dims = input_13_keep_dims_0, x = x_1_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [12, 192]> brain_encoder_net_1_ca_shared_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_ca_shared_mlp_0_weight_to_fp16"), val = tensor<fp16, [12, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1610688)))];
            tensor<fp16, [12]> brain_encoder_net_1_ca_shared_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_ca_shared_mlp_0_bias_to_fp16"), val = tensor<fp16, [12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1615360)))];
            tensor<fp16, [1, 12]> linear_0_cast_fp16 = linear(bias = brain_encoder_net_1_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_1_ca_shared_mlp_0_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_2_cast_fp16 = softplus(x = linear_0_cast_fp16)[name = tensor<string, []>("softplus_2_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_2_cast_fp16 = tanh(x = softplus_2_cast_fp16)[name = tensor<string, []>("tanh_2_cast_fp16")];
            tensor<fp16, [1, 12]> input_17_cast_fp16 = mul(x = linear_0_cast_fp16, y = tanh_2_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [192, 12]> brain_encoder_net_1_ca_shared_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_ca_shared_mlp_2_weight_to_fp16"), val = tensor<fp16, [192, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1615488)))];
            tensor<fp16, [192]> brain_encoder_net_1_ca_shared_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_1_ca_shared_mlp_2_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1620160)))];
            tensor<fp16, [1, 192]> linear_1_cast_fp16 = linear(bias = brain_encoder_net_1_ca_shared_mlp_2_bias_to_fp16, weight = brain_encoder_net_1_ca_shared_mlp_2_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [1]> input_19_axes_0 = const()[name = tensor<string, []>("input_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192]> input_19_cast_fp16 = reduce_max(axes = input_19_axes_0, keep_dims = var_10, x = x_1_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [1, 12]> linear_2_cast_fp16 = linear(bias = brain_encoder_net_1_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_1_ca_shared_mlp_0_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_3_cast_fp16 = softplus(x = linear_2_cast_fp16)[name = tensor<string, []>("softplus_3_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_3_cast_fp16 = tanh(x = softplus_3_cast_fp16)[name = tensor<string, []>("tanh_3_cast_fp16")];
            tensor<fp16, [1, 12]> input_23_cast_fp16 = mul(x = linear_2_cast_fp16, y = tanh_3_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [1, 192]> linear_3_cast_fp16 = linear(bias = brain_encoder_net_1_ca_shared_mlp_2_bias_to_fp16, weight = brain_encoder_net_1_ca_shared_mlp_2_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 192]> var_118_cast_fp16 = add(x = linear_1_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("op_118_cast_fp16")];
            tensor<fp16, [1, 192]> weight_11_cast_fp16 = sigmoid(x = var_118_cast_fp16)[name = tensor<string, []>("weight_11_cast_fp16")];
            tensor<int32, [1]> var_120_axes_0 = const()[name = tensor<string, []>("op_120_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192, 1]> var_120_cast_fp16 = expand_dims(axes = var_120_axes_0, x = weight_11_cast_fp16)[name = tensor<string, []>("op_120_cast_fp16")];
            tensor<fp16, [1, 192, 34]> out_1_cast_fp16 = mul(x = var_120_cast_fp16, y = x_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_25_cast_fp16 = add(x = out_1_cast_fp16, y = input_1_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [192]> brain_encoder_net_2_res_unit_0_running_mean_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_res_unit_0_running_mean_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1620608)))];
            tensor<fp16, [192]> brain_encoder_net_2_res_unit_0_running_var_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_res_unit_0_running_var_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1621056)))];
            tensor<fp16, [192]> brain_encoder_net_2_res_unit_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_res_unit_0_weight_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1621504)))];
            tensor<fp16, [192]> brain_encoder_net_2_res_unit_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_res_unit_0_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1621952)))];
            tensor<fp16, [1, 192, 34]> input_27_cast_fp16 = batch_norm(beta = brain_encoder_net_2_res_unit_0_bias_to_fp16, epsilon = var_6_to_fp16, gamma = brain_encoder_net_2_res_unit_0_weight_to_fp16, mean = brain_encoder_net_2_res_unit_0_running_mean_to_fp16, variance = brain_encoder_net_2_res_unit_0_running_var_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_4_cast_fp16 = softplus(x = input_27_cast_fp16)[name = tensor<string, []>("softplus_4_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_4_cast_fp16 = tanh(x = softplus_4_cast_fp16)[name = tensor<string, []>("tanh_4_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_29_cast_fp16 = mul(x = input_27_cast_fp16, y = tanh_4_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<string, []> input_31_pad_type_0 = const()[name = tensor<string, []>("input_31_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_31_pad_0 = const()[name = tensor<string, []>("input_31_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_31_strides_0 = const()[name = tensor<string, []>("input_31_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_31_dilations_0 = const()[name = tensor<string, []>("input_31_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_31_groups_0 = const()[name = tensor<string, []>("input_31_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1622400)))];
            tensor<fp16, [192]> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1843648)))];
            tensor<fp16, [1, 192, 34]> input_33_cast_fp16 = conv(bias = const_3_to_fp16, dilations = input_31_dilations_0, groups = input_31_groups_0, pad = input_31_pad_0, pad_type = input_31_pad_type_0, strides = input_31_strides_0, weight = const_2_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_5_cast_fp16 = softplus(x = input_33_cast_fp16)[name = tensor<string, []>("softplus_5_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_5_cast_fp16 = tanh(x = softplus_5_cast_fp16)[name = tensor<string, []>("tanh_5_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_35_cast_fp16 = mul(x = input_33_cast_fp16, y = tanh_5_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<string, []> x_3_pad_type_0 = const()[name = tensor<string, []>("x_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> x_3_pad_0 = const()[name = tensor<string, []>("x_3_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> x_3_strides_0 = const()[name = tensor<string, []>("x_3_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> x_3_dilations_0 = const()[name = tensor<string, []>("x_3_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> x_3_groups_0 = const()[name = tensor<string, []>("x_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> brain_encoder_net_2_res_unit_5_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_res_unit_5_weight_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1844096)))];
            tensor<fp16, [1, 192, 34]> x_3_cast_fp16 = conv(dilations = x_3_dilations_0, groups = x_3_groups_0, pad = x_3_pad_0, pad_type = x_3_pad_type_0, strides = x_3_strides_0, weight = brain_encoder_net_2_res_unit_5_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [1]> input_37_axes_0 = const()[name = tensor<string, []>("input_37_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<bool, []> input_37_keep_dims_0 = const()[name = tensor<string, []>("input_37_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192]> input_37_cast_fp16 = reduce_mean(axes = input_37_axes_0, keep_dims = input_37_keep_dims_0, x = x_3_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [12, 192]> brain_encoder_net_2_ca_shared_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_ca_shared_mlp_0_weight_to_fp16"), val = tensor<fp16, [12, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2065344)))];
            tensor<fp16, [12]> brain_encoder_net_2_ca_shared_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_ca_shared_mlp_0_bias_to_fp16"), val = tensor<fp16, [12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2070016)))];
            tensor<fp16, [1, 12]> linear_4_cast_fp16 = linear(bias = brain_encoder_net_2_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_2_ca_shared_mlp_0_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_6_cast_fp16 = softplus(x = linear_4_cast_fp16)[name = tensor<string, []>("softplus_6_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_6_cast_fp16 = tanh(x = softplus_6_cast_fp16)[name = tensor<string, []>("tanh_6_cast_fp16")];
            tensor<fp16, [1, 12]> input_41_cast_fp16 = mul(x = linear_4_cast_fp16, y = tanh_6_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, [192, 12]> brain_encoder_net_2_ca_shared_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_ca_shared_mlp_2_weight_to_fp16"), val = tensor<fp16, [192, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2070144)))];
            tensor<fp16, [192]> brain_encoder_net_2_ca_shared_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_2_ca_shared_mlp_2_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2074816)))];
            tensor<fp16, [1, 192]> linear_5_cast_fp16 = linear(bias = brain_encoder_net_2_ca_shared_mlp_2_bias_to_fp16, weight = brain_encoder_net_2_ca_shared_mlp_2_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<int32, [1]> input_43_axes_0 = const()[name = tensor<string, []>("input_43_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192]> input_43_cast_fp16 = reduce_max(axes = input_43_axes_0, keep_dims = var_10, x = x_3_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<fp16, [1, 12]> linear_6_cast_fp16 = linear(bias = brain_encoder_net_2_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_2_ca_shared_mlp_0_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_7_cast_fp16 = softplus(x = linear_6_cast_fp16)[name = tensor<string, []>("softplus_7_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_7_cast_fp16 = tanh(x = softplus_7_cast_fp16)[name = tensor<string, []>("tanh_7_cast_fp16")];
            tensor<fp16, [1, 12]> input_47_cast_fp16 = mul(x = linear_6_cast_fp16, y = tanh_7_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [1, 192]> linear_7_cast_fp16 = linear(bias = brain_encoder_net_2_ca_shared_mlp_2_bias_to_fp16, weight = brain_encoder_net_2_ca_shared_mlp_2_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [1, 192]> var_176_cast_fp16 = add(x = linear_5_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("op_176_cast_fp16")];
            tensor<fp16, [1, 192]> weight_21_cast_fp16 = sigmoid(x = var_176_cast_fp16)[name = tensor<string, []>("weight_21_cast_fp16")];
            tensor<int32, [1]> var_178_axes_0 = const()[name = tensor<string, []>("op_178_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192, 1]> var_178_cast_fp16 = expand_dims(axes = var_178_axes_0, x = weight_21_cast_fp16)[name = tensor<string, []>("op_178_cast_fp16")];
            tensor<fp16, [1, 192, 34]> out_3_cast_fp16 = mul(x = var_178_cast_fp16, y = x_3_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_49_cast_fp16 = add(x = out_3_cast_fp16, y = input_25_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [192]> brain_encoder_net_3_res_unit_0_running_mean_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_res_unit_0_running_mean_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2075264)))];
            tensor<fp16, [192]> brain_encoder_net_3_res_unit_0_running_var_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_res_unit_0_running_var_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2075712)))];
            tensor<fp16, [192]> brain_encoder_net_3_res_unit_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_res_unit_0_weight_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2076160)))];
            tensor<fp16, [192]> brain_encoder_net_3_res_unit_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_res_unit_0_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2076608)))];
            tensor<fp16, [1, 192, 34]> input_51_cast_fp16 = batch_norm(beta = brain_encoder_net_3_res_unit_0_bias_to_fp16, epsilon = var_6_to_fp16, gamma = brain_encoder_net_3_res_unit_0_weight_to_fp16, mean = brain_encoder_net_3_res_unit_0_running_mean_to_fp16, variance = brain_encoder_net_3_res_unit_0_running_var_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_8_cast_fp16 = softplus(x = input_51_cast_fp16)[name = tensor<string, []>("softplus_8_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_8_cast_fp16 = tanh(x = softplus_8_cast_fp16)[name = tensor<string, []>("tanh_8_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_53_cast_fp16 = mul(x = input_51_cast_fp16, y = tanh_8_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<string, []> input_55_pad_type_0 = const()[name = tensor<string, []>("input_55_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_55_pad_0 = const()[name = tensor<string, []>("input_55_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_55_strides_0 = const()[name = tensor<string, []>("input_55_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_55_dilations_0 = const()[name = tensor<string, []>("input_55_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_55_groups_0 = const()[name = tensor<string, []>("input_55_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> const_4_to_fp16 = const()[name = tensor<string, []>("const_4_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2077056)))];
            tensor<fp16, [192]> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2298304)))];
            tensor<fp16, [1, 192, 34]> input_57_cast_fp16 = conv(bias = const_5_to_fp16, dilations = input_55_dilations_0, groups = input_55_groups_0, pad = input_55_pad_0, pad_type = input_55_pad_type_0, strides = input_55_strides_0, weight = const_4_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_9_cast_fp16 = softplus(x = input_57_cast_fp16)[name = tensor<string, []>("softplus_9_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_9_cast_fp16 = tanh(x = softplus_9_cast_fp16)[name = tensor<string, []>("tanh_9_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_59_cast_fp16 = mul(x = input_57_cast_fp16, y = tanh_9_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<string, []> x_5_pad_type_0 = const()[name = tensor<string, []>("x_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> x_5_pad_0 = const()[name = tensor<string, []>("x_5_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> x_5_strides_0 = const()[name = tensor<string, []>("x_5_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> x_5_dilations_0 = const()[name = tensor<string, []>("x_5_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> x_5_groups_0 = const()[name = tensor<string, []>("x_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> brain_encoder_net_3_res_unit_5_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_res_unit_5_weight_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2298752)))];
            tensor<fp16, [1, 192, 34]> x_5_cast_fp16 = conv(dilations = x_5_dilations_0, groups = x_5_groups_0, pad = x_5_pad_0, pad_type = x_5_pad_type_0, strides = x_5_strides_0, weight = brain_encoder_net_3_res_unit_5_weight_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<int32, [1]> input_61_axes_0 = const()[name = tensor<string, []>("input_61_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<bool, []> input_61_keep_dims_0 = const()[name = tensor<string, []>("input_61_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192]> input_61_cast_fp16 = reduce_mean(axes = input_61_axes_0, keep_dims = input_61_keep_dims_0, x = x_5_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<fp16, [12, 192]> brain_encoder_net_3_ca_shared_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_ca_shared_mlp_0_weight_to_fp16"), val = tensor<fp16, [12, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2520000)))];
            tensor<fp16, [12]> brain_encoder_net_3_ca_shared_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_ca_shared_mlp_0_bias_to_fp16"), val = tensor<fp16, [12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2524672)))];
            tensor<fp16, [1, 12]> linear_8_cast_fp16 = linear(bias = brain_encoder_net_3_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_3_ca_shared_mlp_0_weight_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_10_cast_fp16 = softplus(x = linear_8_cast_fp16)[name = tensor<string, []>("softplus_10_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_10_cast_fp16 = tanh(x = softplus_10_cast_fp16)[name = tensor<string, []>("tanh_10_cast_fp16")];
            tensor<fp16, [1, 12]> input_65_cast_fp16 = mul(x = linear_8_cast_fp16, y = tanh_10_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, [192, 12]> brain_encoder_net_3_ca_shared_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_ca_shared_mlp_2_weight_to_fp16"), val = tensor<fp16, [192, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2524800)))];
            tensor<fp16, [192]> brain_encoder_net_3_ca_shared_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_3_ca_shared_mlp_2_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2529472)))];
            tensor<fp16, [1, 192]> linear_9_cast_fp16 = linear(bias = brain_encoder_net_3_ca_shared_mlp_2_bias_to_fp16, weight = brain_encoder_net_3_ca_shared_mlp_2_weight_to_fp16, x = input_65_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<int32, [1]> input_67_axes_0 = const()[name = tensor<string, []>("input_67_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192]> input_67_cast_fp16 = reduce_max(axes = input_67_axes_0, keep_dims = var_10, x = x_5_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<fp16, [1, 12]> linear_10_cast_fp16 = linear(bias = brain_encoder_net_3_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_3_ca_shared_mlp_0_weight_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_11_cast_fp16 = softplus(x = linear_10_cast_fp16)[name = tensor<string, []>("softplus_11_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_11_cast_fp16 = tanh(x = softplus_11_cast_fp16)[name = tensor<string, []>("tanh_11_cast_fp16")];
            tensor<fp16, [1, 12]> input_71_cast_fp16 = mul(x = linear_10_cast_fp16, y = tanh_11_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<fp16, [1, 192]> linear_11_cast_fp16 = linear(bias = brain_encoder_net_3_ca_shared_mlp_2_bias_to_fp16, weight = brain_encoder_net_3_ca_shared_mlp_2_weight_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [1, 192]> var_234_cast_fp16 = add(x = linear_9_cast_fp16, y = linear_11_cast_fp16)[name = tensor<string, []>("op_234_cast_fp16")];
            tensor<fp16, [1, 192]> weight_31_cast_fp16 = sigmoid(x = var_234_cast_fp16)[name = tensor<string, []>("weight_31_cast_fp16")];
            tensor<int32, [1]> var_236_axes_0 = const()[name = tensor<string, []>("op_236_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192, 1]> var_236_cast_fp16 = expand_dims(axes = var_236_axes_0, x = weight_31_cast_fp16)[name = tensor<string, []>("op_236_cast_fp16")];
            tensor<fp16, [1, 192, 34]> out_5_cast_fp16 = mul(x = var_236_cast_fp16, y = x_5_cast_fp16)[name = tensor<string, []>("out_5_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_73_cast_fp16 = add(x = out_5_cast_fp16, y = input_49_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<fp16, [192]> brain_encoder_net_4_res_unit_0_running_mean_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_res_unit_0_running_mean_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2529920)))];
            tensor<fp16, [192]> brain_encoder_net_4_res_unit_0_running_var_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_res_unit_0_running_var_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2530368)))];
            tensor<fp16, [192]> brain_encoder_net_4_res_unit_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_res_unit_0_weight_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2530816)))];
            tensor<fp16, [192]> brain_encoder_net_4_res_unit_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_res_unit_0_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2531264)))];
            tensor<fp16, [1, 192, 34]> input_75_cast_fp16 = batch_norm(beta = brain_encoder_net_4_res_unit_0_bias_to_fp16, epsilon = var_6_to_fp16, gamma = brain_encoder_net_4_res_unit_0_weight_to_fp16, mean = brain_encoder_net_4_res_unit_0_running_mean_to_fp16, variance = brain_encoder_net_4_res_unit_0_running_var_to_fp16, x = input_73_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_12_cast_fp16 = softplus(x = input_75_cast_fp16)[name = tensor<string, []>("softplus_12_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_12_cast_fp16 = tanh(x = softplus_12_cast_fp16)[name = tensor<string, []>("tanh_12_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_77_cast_fp16 = mul(x = input_75_cast_fp16, y = tanh_12_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<string, []> input_79_pad_type_0 = const()[name = tensor<string, []>("input_79_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_79_pad_0 = const()[name = tensor<string, []>("input_79_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_79_strides_0 = const()[name = tensor<string, []>("input_79_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_79_dilations_0 = const()[name = tensor<string, []>("input_79_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_79_groups_0 = const()[name = tensor<string, []>("input_79_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> const_6_to_fp16 = const()[name = tensor<string, []>("const_6_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2531712)))];
            tensor<fp16, [192]> const_7_to_fp16 = const()[name = tensor<string, []>("const_7_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2752960)))];
            tensor<fp16, [1, 192, 34]> input_81_cast_fp16 = conv(bias = const_7_to_fp16, dilations = input_79_dilations_0, groups = input_79_groups_0, pad = input_79_pad_0, pad_type = input_79_pad_type_0, strides = input_79_strides_0, weight = const_6_to_fp16, x = input_77_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_13_cast_fp16 = softplus(x = input_81_cast_fp16)[name = tensor<string, []>("softplus_13_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_13_cast_fp16 = tanh(x = softplus_13_cast_fp16)[name = tensor<string, []>("tanh_13_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_83_cast_fp16 = mul(x = input_81_cast_fp16, y = tanh_13_cast_fp16)[name = tensor<string, []>("input_83_cast_fp16")];
            tensor<string, []> x_7_pad_type_0 = const()[name = tensor<string, []>("x_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> x_7_pad_0 = const()[name = tensor<string, []>("x_7_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> x_7_strides_0 = const()[name = tensor<string, []>("x_7_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> x_7_dilations_0 = const()[name = tensor<string, []>("x_7_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> x_7_groups_0 = const()[name = tensor<string, []>("x_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> brain_encoder_net_4_res_unit_5_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_res_unit_5_weight_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2753408)))];
            tensor<fp16, [1, 192, 34]> x_7_cast_fp16 = conv(dilations = x_7_dilations_0, groups = x_7_groups_0, pad = x_7_pad_0, pad_type = x_7_pad_type_0, strides = x_7_strides_0, weight = brain_encoder_net_4_res_unit_5_weight_to_fp16, x = input_83_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<int32, [1]> input_85_axes_0 = const()[name = tensor<string, []>("input_85_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<bool, []> input_85_keep_dims_0 = const()[name = tensor<string, []>("input_85_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192]> input_85_cast_fp16 = reduce_mean(axes = input_85_axes_0, keep_dims = input_85_keep_dims_0, x = x_7_cast_fp16)[name = tensor<string, []>("input_85_cast_fp16")];
            tensor<fp16, [12, 192]> brain_encoder_net_4_ca_shared_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_ca_shared_mlp_0_weight_to_fp16"), val = tensor<fp16, [12, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2974656)))];
            tensor<fp16, [12]> brain_encoder_net_4_ca_shared_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_ca_shared_mlp_0_bias_to_fp16"), val = tensor<fp16, [12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2979328)))];
            tensor<fp16, [1, 12]> linear_12_cast_fp16 = linear(bias = brain_encoder_net_4_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_4_ca_shared_mlp_0_weight_to_fp16, x = input_85_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_14_cast_fp16 = softplus(x = linear_12_cast_fp16)[name = tensor<string, []>("softplus_14_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_14_cast_fp16 = tanh(x = softplus_14_cast_fp16)[name = tensor<string, []>("tanh_14_cast_fp16")];
            tensor<fp16, [1, 12]> input_89_cast_fp16 = mul(x = linear_12_cast_fp16, y = tanh_14_cast_fp16)[name = tensor<string, []>("input_89_cast_fp16")];
            tensor<fp16, [192, 12]> brain_encoder_net_4_ca_shared_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_ca_shared_mlp_2_weight_to_fp16"), val = tensor<fp16, [192, 12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2979456)))];
            tensor<fp16, [192]> brain_encoder_net_4_ca_shared_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_4_ca_shared_mlp_2_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2984128)))];
            tensor<fp16, [1, 192]> linear_13_cast_fp16 = linear(bias = brain_encoder_net_4_ca_shared_mlp_2_bias_to_fp16, weight = brain_encoder_net_4_ca_shared_mlp_2_weight_to_fp16, x = input_89_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<int32, [1]> input_91_axes_0 = const()[name = tensor<string, []>("input_91_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192]> input_91_cast_fp16 = reduce_max(axes = input_91_axes_0, keep_dims = var_10, x = x_7_cast_fp16)[name = tensor<string, []>("input_91_cast_fp16")];
            tensor<fp16, [1, 12]> linear_14_cast_fp16 = linear(bias = brain_encoder_net_4_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_4_ca_shared_mlp_0_weight_to_fp16, x = input_91_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_15_cast_fp16 = softplus(x = linear_14_cast_fp16)[name = tensor<string, []>("softplus_15_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_15_cast_fp16 = tanh(x = softplus_15_cast_fp16)[name = tensor<string, []>("tanh_15_cast_fp16")];
            tensor<fp16, [1, 12]> input_95_cast_fp16 = mul(x = linear_14_cast_fp16, y = tanh_15_cast_fp16)[name = tensor<string, []>("input_95_cast_fp16")];
            tensor<fp16, [1, 192]> linear_15_cast_fp16 = linear(bias = brain_encoder_net_4_ca_shared_mlp_2_bias_to_fp16, weight = brain_encoder_net_4_ca_shared_mlp_2_weight_to_fp16, x = input_95_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<fp16, [1, 192]> var_292_cast_fp16 = add(x = linear_13_cast_fp16, y = linear_15_cast_fp16)[name = tensor<string, []>("op_292_cast_fp16")];
            tensor<fp16, [1, 192]> weight_41_cast_fp16 = sigmoid(x = var_292_cast_fp16)[name = tensor<string, []>("weight_41_cast_fp16")];
            tensor<int32, [1]> var_294_axes_0 = const()[name = tensor<string, []>("op_294_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 192, 1]> var_294_cast_fp16 = expand_dims(axes = var_294_axes_0, x = weight_41_cast_fp16)[name = tensor<string, []>("op_294_cast_fp16")];
            tensor<fp16, [1, 192, 34]> out_7_cast_fp16 = mul(x = var_294_cast_fp16, y = x_7_cast_fp16)[name = tensor<string, []>("out_7_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_97_cast_fp16 = add(x = out_7_cast_fp16, y = input_73_cast_fp16)[name = tensor<string, []>("input_97_cast_fp16")];
            tensor<fp16, [192]> brain_encoder_net_5_res_unit_0_running_mean_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_5_res_unit_0_running_mean_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2984576)))];
            tensor<fp16, [192]> brain_encoder_net_5_res_unit_0_running_var_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_5_res_unit_0_running_var_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2985024)))];
            tensor<fp16, [192]> brain_encoder_net_5_res_unit_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_5_res_unit_0_weight_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2985472)))];
            tensor<fp16, [192]> brain_encoder_net_5_res_unit_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_5_res_unit_0_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2985920)))];
            tensor<fp16, [1, 192, 34]> input_99_cast_fp16 = batch_norm(beta = brain_encoder_net_5_res_unit_0_bias_to_fp16, epsilon = var_6_to_fp16, gamma = brain_encoder_net_5_res_unit_0_weight_to_fp16, mean = brain_encoder_net_5_res_unit_0_running_mean_to_fp16, variance = brain_encoder_net_5_res_unit_0_running_var_to_fp16, x = input_97_cast_fp16)[name = tensor<string, []>("input_99_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_16_cast_fp16 = softplus(x = input_99_cast_fp16)[name = tensor<string, []>("softplus_16_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_16_cast_fp16 = tanh(x = softplus_16_cast_fp16)[name = tensor<string, []>("tanh_16_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_101_cast_fp16 = mul(x = input_99_cast_fp16, y = tanh_16_cast_fp16)[name = tensor<string, []>("input_101_cast_fp16")];
            tensor<string, []> input_103_pad_type_0 = const()[name = tensor<string, []>("input_103_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_103_pad_0 = const()[name = tensor<string, []>("input_103_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_103_strides_0 = const()[name = tensor<string, []>("input_103_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_103_dilations_0 = const()[name = tensor<string, []>("input_103_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_103_groups_0 = const()[name = tensor<string, []>("input_103_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> const_8_to_fp16 = const()[name = tensor<string, []>("const_8_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2986368)))];
            tensor<fp16, [192]> const_9_to_fp16 = const()[name = tensor<string, []>("const_9_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3207616)))];
            tensor<fp16, [1, 192, 34]> input_105_cast_fp16 = conv(bias = const_9_to_fp16, dilations = input_103_dilations_0, groups = input_103_groups_0, pad = input_103_pad_0, pad_type = input_103_pad_type_0, strides = input_103_strides_0, weight = const_8_to_fp16, x = input_101_cast_fp16)[name = tensor<string, []>("input_105_cast_fp16")];
            tensor<fp16, [1, 192, 34]> softplus_17_cast_fp16 = softplus(x = input_105_cast_fp16)[name = tensor<string, []>("softplus_17_cast_fp16")];
            tensor<fp16, [1, 192, 34]> tanh_17_cast_fp16 = tanh(x = softplus_17_cast_fp16)[name = tensor<string, []>("tanh_17_cast_fp16")];
            tensor<fp16, [1, 192, 34]> input_107_cast_fp16 = mul(x = input_105_cast_fp16, y = tanh_17_cast_fp16)[name = tensor<string, []>("input_107_cast_fp16")];
            tensor<string, []> x_9_pad_type_0 = const()[name = tensor<string, []>("x_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> x_9_pad_0 = const()[name = tensor<string, []>("x_9_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> x_9_strides_0 = const()[name = tensor<string, []>("x_9_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> x_9_dilations_0 = const()[name = tensor<string, []>("x_9_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> x_9_groups_0 = const()[name = tensor<string, []>("x_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [192, 192, 3]> brain_encoder_net_5_res_unit_5_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_5_res_unit_5_weight_to_fp16"), val = tensor<fp16, [192, 192, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3208064)))];
            tensor<fp16, [1, 192, 34]> x_9_cast_fp16 = conv(dilations = x_9_dilations_0, groups = x_9_groups_0, pad = x_9_pad_0, pad_type = x_9_pad_type_0, strides = x_9_strides_0, weight = brain_encoder_net_5_res_unit_5_weight_to_fp16, x = input_107_cast_fp16)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<int32, [1]> input_109_axes_0 = const()[name = tensor<string, []>("input_109_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<bool, []> input_109_keep_dims_0 = const()[name = tensor<string, []>("input_109_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192]> input_109_cast_fp16 = reduce_mean(axes = input_109_axes_0, keep_dims = input_109_keep_dims_0, x = x_9_cast_fp16)[name = tensor<string, []>("input_109_cast_fp16")];
            tensor<fp16, [12, 192]> brain_encoder_net_5_ca_shared_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_5_ca_shared_mlp_0_weight_to_fp16"), val = tensor<fp16, [12, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3429312)))];
            tensor<fp16, [12]> brain_encoder_net_5_ca_shared_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("brain_encoder_net_5_ca_shared_mlp_0_bias_to_fp16"), val = tensor<fp16, [12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3433984)))];
            tensor<fp16, [1, 12]> linear_16_cast_fp16 = linear(bias = brain_encoder_net_5_ca_shared_mlp_0_bias_to_fp16, weight = brain_encoder_net_5_ca_shared_mlp_0_weight_to_fp16, x = input_109_cast_fp16)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<fp16, [1, 12]> softplus_18_cast_fp16 = softplus(x = linear_16_cast_fp16)[name = tensor<string, []>("softplus_18_cast_fp16")];
            tensor<fp16, [1, 12]> tanh_18_cast_fp16 = tanh(x = softplus_18_cast_fp16)[name = tensor<string, []>("tanh_18_cast_fp16")];
            tensor<fp16, [1, 12]> input_113_cast_fp16 = mul(x = linear_16_cast_fp16, y = tanh_18_cast_fp16)[name = tensor<string, []>("input_113_cast_fp16")];
